Revit 2026 API

# CableSizeGroundConductorSize Property

---

The size of a Ground Conductor.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GroundConductorSize { get; set; }
```
```vb
Public Property GroundConductorSize As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ GroundConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member GroundConductorSize : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Size id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

Each Ground Conductor has the same size.

#### Reference

CableSize Class

Autodesk.Revit.DB.Electrical Namespace